const arr = [1,2,3]

arr.forEach(function(el){
    console.log(el)
}) // 1, 2, 3

arr.forEach(el => console.log(el)) // 1, 2, 3

//Η forEach μέθοδος είναι μια μέθοδος που υπάρχει σε κάθε πίνακα και εκτελεί μια συνάρτηση για κάθε στοιχείο του πίνακα. Δεχεται μια συνάρτηση ως όρισμα και αυτή η συνάρτηση δέχεται ως όρισμα το τρέχον στοιχείο του πίνακα. Η forEach μέθοδος δεν επιστρέφει κάτι.

//Για καθε στοιχείο του πίνακα arr, εκτελείται η συνάρτηση console.log(el) όπου el είναι το τρέχον στοιχείο του πίνακα. Στην περίπτωση αυτή, το πρόγραμμα εκτυπώνει τα στοιχεία του πίνακα arr, δηλαδή το 1, 2 και 3.